{"data":{"wordpressPage":{"title":"Scholarship Terms &#038; Conditions","content":"<h3>Scholarship Terms &amp; Conditions</h3>\n<p>The administration of the contest, including and without limitation, will determine the eligibility of a student or entry, selecting of a judge, evaluating any submitted entry, and awarding of the prizes, and is within the sole and absolute discretion of the Bill of Rights Institute. No student or teacher, or person or organization related there to, has a right to appeal, contest, dispute, or otherwise challenge any aspect of the administration of the Contest, and any decision of the Bill of Rights Institute is final in all respects.</p>\n<p>No responsibility is assumed for incorrect or inaccurate entry information whether caused by any of the equipment or programming associated with or utilized by this contest or by any human error which may occur in the processing of entries into this Contest. The Bill of Rights Institute is not responsible for lost, late, misdirected, or delayed entries or any problems or technical malfunctions of any telephone network or lines, computer on-line systems, servers or providers, computer equipment, software, failure of players on account of technical problems, or traffic congestion on the Internet or at any website or<br />\ncombination thereof.</p>\n<p>If, for any reason, the Contest is not capable of running as planned, including infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the control of the Bill of Rights Institute, which corrupt or affect the administration, security, fairness, integrity or proper conduct of this contest or for any reason the Bill of Rights Institute deems it necessary, the Bill of Rights Institute reserves the right to cancel, modify, or delay the Contest.</p>\n<h3><strong>Prize</strong></h3>\n<p>Prizes will be awarded within three (3) months of the close of the Contest. Prizes not claimed within 180 days of the check date or the end of the Contest will be void. The Bill of Rights Institute will make its best effort to mail the prize to the winner and is not responsible for incorrect address provided by the<br />\ncontestant. All entrants are solely responsible for understanding and complying with any and all federal, state, and local laws, codes, regulations, and ordinances that may apply to the entrants and the activities or business in which such entrants may engage. There may be tax consequences associated with the prizes and income received by a Contest winner, which may include, without limitation, an obligation to report as income and to pay taxes on such income to federal, state, or local authorities.</p>\n<p>Each Contest winner is responsible to determine the tax consequences of the income received and to comply with all applicable laws in all respects. All prize-winning teachers are solely responsible for understanding and complying with any and all federal, state, and local laws, codes, regulations, and ordinances, as well as school policies that may apply.</p>\n<h3><strong>Nondiscrimination Policy</strong></h3>\n<p>In administering the Contest, the Bill of Rights Institute will not discriminate in any manner, including on the basis of race, color, national, or ethnic origin.</p>\n","yoast_meta":{"yoast_wpseo_title":"Scholarship Terms & Conditions - Chumba Casino","yoast_wpseo_metadesc":"","yoast_wpseo_canonical":"https://jeffazvgithubber.github.io/scholarship-terms-conditions/","yoast_wpseo_facebook_title":"","yoast_wpseo_facebook_description":"","yoast_wpseo_facebook_type":"page","yoast_wpseo_facebook_image":"","yoast_wpseo_twitter_title":"","yoast_wpseo_twitter_description":"","yoast_wpseo_twitter_image":"","yoast_wpseo_social_url":"https://jeffazvgithubber.github.io/scholarship-terms-conditions/","yoast_wpseo_company_or_person":"","yoast_wpseo_person_name":"","yoast_wpseo_company_name":"","yoast_wpseo_company_logo":"","yoast_wpseo_website_name":""},"acf":null}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"5a782110-280b-56d2-b33e-4fcf249aaa66"}}