{"data":{"wordpressPage":{"title":"Sweeps Rules","content":"<p>NO PURCHASE OR PAYMENT NECESSARY. A PURCHASE OR PAYMENT OF ANY KIND WILL NOT INCREASE A PARTICIPANT’S CHANCES OF WINNING.</p>\n<p>&nbsp;</p>\n<p>[foobar]</p>\n<div>[marketingsiteurl]</div>\n<p>Chumba Casino is an online casino which offers Participants the chance to play games for entertainment and enjoyment. Chumba Casino also gives away Sweepstakes/Prize Promotion Cash as set out in these Official Rules. Sweepstakes/Prize Promotion Cash can be used to play Sweepstakes Games for a chance to win cash prizes.</p>\n<p><strong>1. Eligibility to play Chumba Casino</strong></p>\n<p>Chumba Casino Sweepstakes/Prize Promotion (the “Sweepstakes/Prize Promotion”) is open only to legal residents of the fifty (50) United States (including District of Columbia) and Canada (excluding residents of the province of Quebec), who are at least eighteen (18) years old or the age of majority in their jurisdiction (whichever occurs later) at the time of entry. PARTICIPATION IS VOID WHERE PROHIBITED BY LAW.</p>\n<p>A person that participates in the Sweepstakes/Prize Promotion is a “Participant”.</p>\n<p>The Sweepstakes/Prize Promotion is subject to all applicable federal, state, provincial, territorial and local laws and regulations. It is the sole responsibility of a Participant to determine whether a sweepstakes is legal and compliant with all regulations in the jurisdiction in which the Participant resides. Participation constitutes the Participant’s full and unconditional agreement to these Sweepstakes/Prize Promotion Official Rules (the “Official Rules”) and Sponsor’s/Promoter’s decisions, which are final and binding in all matters related to the Sweepstakes/Prize Promotion. Winning a prize is contingent upon fulfilling all requirements set out in these Official Rules.</p>\n<p>Employees of VGW Malta Limited or VGW RMG Malta Limited any of their respective affiliates, subsidiaries, advertising agencies, or any other company or individual involved with the design, production execution or distribution of the Sweepstakes/Prize Promotion and their immediate family (spouse, parents and step-parents, siblings and step-siblings, and children and step-children) and household members (people who share the same residence at least three (3) months out of the year) of each such employee are not eligible to participate.</p>\n<p><strong>2. Sponsor/Promoter</strong></p>\n<p>VGW RMG Malta Limited of Valletta Buildings, 2nd Floor, Suite 7, South Street, Valletta, Malta.</p>\n<p><strong>3. How to Collect Sweepstakes/Prize Promotion Cash</strong></p>\n<p>In the Sweepstakes/Prize Promotion, Sweepstakes/Prize Promotion Cash is referred to as &#8220;$weeps Cash™&#8221;.</p>\n<p>A Participant first must be a member of Chumba Casino (if a Participant is not a member, the Participant can become one for free at www.chumbacasino.com). To enter the Sweepstakes/Prize Promotion, a Participant first must access the Chumba Casino at <a href=\"https://www.chumbacasino.com/\">www.chumbacasino.com</a> and sign in. Once a Participant accesses Chumba Casino, there are three potential ways to collect Sweepstakes/Prize Promotion Cash:</p>\n<ul>\n<li><span style=\"text-decoration: underline;\">Receive Sweepstakes/Prize Promotion Cash when purchasing Gold Coins</span>. Each Participant will automatically receive Sweepstakes/Prize Promotion Cash when they purchase Gold Coins. Gold Coins can only be used for casual game play in Chumba Casino and are not eligible to win cash prizes. The amount of Sweepstakes/Prize Promotion Cash a Participant will receive for each Gold Coin purchase will be stated in the website purchase window. All purchases of Gold Coins are final and no refunds will be given.</li>\n<li><span style=\"text-decoration: underline;\">Receive Sweepstakes/Prize Promotion Cash when entering Sweeps giveaway contests on the Chumba Casino Facebook Page</span>. The Sponsor/Promoter regularly holds Sweepstakes/Prize Promotion Cash giveaway contests in which Participants can enter by following the instructions on Sweeps giveaway contests posted on the Facebook Page. These giveaways may require sharing the Facebook Page posts or answering various game related questions to be eligible for entry. The amount given away will be stated on each post for the Sweeps giveaway contest, and will be credited to the contest winners&#8217; accounts.</li>\n<li><span style=\"text-decoration: underline;\">Receive Sweepstakes/Prize Promotion Cash for Chumba Casino website sending a mailed request</span>. US and Canadian (excluding Quebec) Participants can receive Sweepstakes/Prize Promotion Cash by sending a stamped #10 envelope, hand written, to the following:\n<ul>\n<li>for US residents: VGW RMG LIMITED, CHUMBA CASINO SWEEPSTAKES DEPARTMENT, PO BOX #8486, PORTSMOUTH, NH 03801;</li>\n<li>for Canadian residents: VGW RMG LIMITED, CHUMBA CASINO SWEEPSTAKES DEPARTMENT, PO BOX #990 135 WEST BEAVER CREEK ROAD, RICHMOND HILL, ONTARIO L3T2C0.</li>\n</ul>\n<p>Participants must include their full name and return address to the front of the envelope and words: &#8220;Sweepstakes Credits:&#8221; followed by the current month and year (example: Sweepstakes Credits: January 2017). Limit one request per outer envelope. For each request a Participant submits the Participant will receive 500 Sweepstakes/Prize Promotion Cash. The Sweepstakes/Prize Promotion Cash will be added to the Participant&#8217;s account. <strong>NOTE: Participants must ensure that their hand writing is legible</strong>. If the Participant’s hand writing is not legible, the entry will be void and the $weeps Cash™ will not be credited to the Participant’s account.</li>\n</ul>\n<p>The amount of Sweepstakes/Prize Promotion Cash a Participant has will be displayed in their account on the website. The amount of Sweepstakes/Prize Promotion Cash to be allocated to Participants can be changed at any time by the Sponsor/Promoter in its sole discretion. Sponsor/Promoter is not responsible for lost, late, incomplete, invalid, unintelligible or misdirected Sweepstakes/Prize Promotion Cash requests or allocations. In the event of a dispute as to any registration, the authorized account holder of the email address used to register the Chumba Casino account will be deemed to be the Participant. The &#8220;authorized account holder&#8221; is the natural person assigned the email address by an Internet access provider, online service provider or other organization responsible for assigning email addresses for the domain associated with the submitted address. Use of any automated or other system(s) to participate, to acquire Sweepstakes/Prize Promotion Cash or play the games is prohibited and will result in disqualification. Sweepstakes/Prize Promotion Cash will be forfeited if a Participant’s account is deactivated for any reason, is inactive for 60 consecutive days, or at the Sponsor/Promoter’s discretion.</p>\n<p><strong>4. Using Sweepstakes/Prize Promotion Cash to Play Games</strong></p>\n<p>Participants who have Sweepstakes/Prize Promotion Cash will be able to play games within Chumba Casino for a chance to win cash prizes. Within Chumba Casino there are different games. The amount of Sweepstakes/Prize Promotion Cash required to play each game will be detailed next to the game. A Participant may be able to increase the amount of Sweepstakes/Prize Promotion Cash they play the game with so they can increase their potential winning eligibility. Only games played with Sweepstakes/Prize Promotion Cash will be eligible to win cash prizes. The prize that can be won while playing a game will be shown in Chumba Casino by clicking the &#8220;Win Table&#8221; or “Pay Table” button, denominated as &#8220;Sweepstakes/Prize Promotion Cash&#8221;, for which each credit has a value of $0.01USD. Sponsor&#8217;s/Promoter’s decisions as to the administration and operation of the Sweepstakes/Prize Promotion, the game and the amount of winnings are final and binding.</p>\n<p>Sweepstakes/Prize Promotion Cash must be played a minimum of 20 times in any combination of Sweepstakes/Prize Promotion Cash games to be eligible to receive a prize. Prize payouts are restricted in accordance with Section 7 below.</p>\n<p>Sponsor/Promoter reserves the right to change the payout rates and odds of any of the Sweepstakes/Prize Promotion games at any time. A Participant can see the actual and any amended details by clicking on the &#8220;Win Table” or “Pay Table” button. It is a Participant’s responsibility to check the payouts on each occasion before they participate.</p>\n<p>In New York and Florida the maximum gross win (&#8220;Maximum Win&#8221;) on any one spin, via a Participant’s participation in the Sweepstakes/Prize Promotion Games, is limited to $5,000USD. Any gross win in excess of the Maximum Win will not be paid.</p>\n<p>There is a maximum Sweepstakes/Prize Promotion payout limit of $10,000USD per day. No more than the stated number of prizes will be awarded.</p>\n<p>5. POTENTIAL SWEEPSTAKES/PRIZE PROMOTION WINNERS ARE SUBJECT TO VERIFICATION BY SPONSOR/PROMOTER (IN ANY MANNER IT MAY CHOOSE) WHOSE DECISIONS ARE FINAL AND BINDING IN ALL MATTERS RELATED TO THE SWEEPSTAKES/PRIZE PROMOTION. A PARTICIPANT IS NOT A WINNER OF ANY PRIZE, EVEN IF THE ONLINE SCREEN INDICATES, UNLESS AND UNTIL THE PARTICIPANT&#8217;S ELIGIBILITY AND THE POTENTIAL WINNING PLAY HAS BEEN VERIFIED AND THE PARTICIPANT HAS FULLY COMPLIED WITH THESE RULES AND BEEN NOTIFIED THAT VERIFICATION IS COMPLETE. SPONSOR/PROMOTER WILL NOT ACCEPT SCREEN SHOTS OR OTHER PURPORTED EVIDENCE OF WINNING IN LIEU OF ITS VALIDATION PROCESS.</p>\n<p><strong>6. Verification and Confirmation of Potential Winners</strong></p>\n<p>Potential prize winners must comply with these Official Rules and winning is contingent upon fulfilling all requirements. A potential prize winner may be required to sign and return to Sponsor/Promoter, an affidavit/declaration of eligibility, and liability/publicity release (except where prohibited) in order to claim his/her prize (if applicable). In addition, in the case of a Canadian eligible winner, he/she will be required to correctly answer a mathematical skill-testing question without mechanical or other aid to be administered at a pre-arranged mutually convenient time. If a potential winner cannot be contacted, fails to properly execute and return the affidavit/declaration of eligibility and liability/publicity release within the required time period (if applicable), fails to comply with these Official Rules (including, but not limited to, the requirement to correctly answer the mathematical skill-testing question if a resident of Canada), or if the prize or prize notification is returned as undeliverable, that potential winner forfeits the prize. In the event that a potential winner of a Sweepstakes/Prize Promotion prize is disqualified for any reason, Sponsor/Promoter may award the applicable prize to an alternate winner by random drawing from among all remaining eligible entries which will be independently verified.</p>\n<p><strong>7. Prizes</strong></p>\n<p>A Participant&#8217;s prize balance is stated in the Participant&#8217;s account. All cash prizes will be paid out in USD or in the currency of the winner’s jurisdiction of residence using an account of a payment provider authorised by Sponsor/Promoter, as amended from time to time. Sponsor/Promoter will only payout if the request is $100USD equivalent or more (10,000 Sweepstakes/Prize Promotion Cash credits). A Participant is not able to cash out until his or account has a balance of $100USD or more (10,000 Chumba Sweepstakes/Prize Promotion Cash credits).</p>\n<p>TO BE ELIGIBLE FOR CASH OUT: (a) A PARTICIPANT MUST BE A RESIDENT OF EITHER THE UNITED STATES OR CANADA AND MUST NOT RESIDE IN THE PROVINCE OF QUEBEC; AND (b) PARTICIPANT DETAILS MUST MATCH THOSE OF THE PARTICIPANT’S ACCOUNT.</p>\n<p>Sponsor/Promoter is not responsible for any taxes or fees associated with a prize payout. Prizes are non-transferable and no substitution will be made except as provided herein at the Sponsor&#8217;s/Promoter’s sole discretion. Sponsor/Promoter reserves the right to substitute the listed prize for one of equal or greater value for any reason owing to circumstances outside Sponsor’s/Promoter’s reasonable control. Winners are responsible for all applicable taxes and fees associated with prize receipt and/or use. Winners will be notified by private message or email within 5 business days of winning.</p>\n<p><strong>8. Entry Conditions and Release</strong></p>\n<p>By participating, each Participant agrees to: (a) comply with and be bound by these Official Rules and the decisions of the Sponsor/Promoter which are binding and final; (b) release and hold harmless the Sponsor/Promoter and its parent, subsidiary, and affiliated companies, the prize suppliers and any other organizations responsible for sponsoring, fulfilling, administering, advertising or promoting the Sweepstakes/Prize Promotion, and all of their respective past and present officers, directors, employees, agents and representatives (collectively, the &#8220;Released Parties&#8221;) from and against any and all claims, expenses, and liability, including but not limited to negligence and damages of any kind to persons and property, including but not limited to invasion of privacy (under appropriation, intrusion, public disclosure of private facts, false light in the public eye or other legal theory), defamation, slander, libel, violation of right of publicity, infringement of trademark, copyright or other intellectual property rights, property damage, or death or personal injury arising out of or relating to a Participant&#8217;s entry, creation of an entry or submission of an entry, participation in the Sweepstakes/Prize Promotion, acceptance or use or misuse of prize (including any travel or activity related thereto) and/or the broadcast, exploitation or use of entry; and (c) indemnify, defend and hold harmless the Sponsor/Promoter from and against any and all claims, expenses, and liabilities (including reasonable attorneys/legal fees) arising out of or relating to an Participant&#8217;s participation in the Sweepstakes/Prize Promotion and/or Participant&#8217;s acceptance, use or misuse of prizes.</p>\n<p><strong>9. Publicity</strong></p>\n<p>Except where prohibited, participation in the Sweepstakes/Prize Promotion constitutes each winner’s consent to Sponsor&#8217;s/Promoter’s and its agents&#8217; use of winner&#8217;s name, likeness, photograph, voice, opinions and/or hometown and state/province/territory for promotional purposes in any media, worldwide, without further payment, notice or consideration.</p>\n<p><strong>10. General Conditions</strong></p>\n<p>Sponsor/Promoter reserves the right to cancel, suspend and/or modify the Sweepstakes/Prize Promotion or these Official Rules, or any part of it, with immediate effect owing to circumstances outside its reasonable control and only where circumstances make it unavoidable if any fraud, technical failures or any other factor beyond Sponsor&#8217;s/Promoter’s reasonable control impairs the integrity or proper functioning of the Sweepstakes/Prize Promotion, as determined by Sponsor/Promoter in its sole discretion. Sponsor/Promoter reserves the right in its sole discretion to disqualify any individual it finds to be tampering with the entry process or the operation of the Sweepstakes/Prize Promotion or to be acting in violation of these Official Rules or any other promotion or in an unsportsmanlike or disruptive manner. Any attempt by any person to deliberately undermine the legitimate operation of the Sweepstakes/Prize Promotion may be a violation of criminal and civil law, and, should such an attempt be made, Sponsor/Promoter reserves the right to seek damages from any such person to the fullest extent permitted by law. Sponsor&#8217;s/Promoter’s failure to enforce any term of these Official Rules shall not constitute a waiver of that provision.</p>\n<p>In all other cases, the Sponsor/Promoter reserves the right to cancel, suspend and/or modify the Sweepstakes/Prize Promotion. Any notice regarding cancellation, suspension and/or modification will be posted on Chumba Casino at www.chumbacasino.com. In the event of modifying the promotion, a Participant’s continued enrolment in the promotion constitutes acceptance of the modified terms.</p>\n<p><strong>11. Limitations of Liability</strong></p>\n<p>Insofar as permitted by law in the respective territories, the Released Parties are not responsible for: (a) any incorrect or inaccurate information, whether caused by Participants, printing errors or by any of the equipment or programming associated with or utilized in the Sweepstakes/Prize Promotion; (b) technical failures of any kind, including, but not limited to malfunctions, interruptions, or disconnections in phone lines or network hardware or software; (c) unauthorized human intervention in any part of the entry process or the Sweepstakes/Prize Promotion; (d) technical or human error which may occur in the administration or operation of the Sweepstakes/Prize Promotion or (e) any injury or damage to persons or property which may be caused, directly or indirectly, in whole or in part, from Participant&#8217;s participation in the Sweepstakes/Prize Promotion or receipt or use or misuse of any prize. If for any reason a Participant&#8217;s Sweepstakes/Prize Promotion credit or winning play is confirmed to have been erroneously deleted, lost, or otherwise destroyed or corrupted, Participant&#8217;s sole remedy is another Sweepstakes/Prize Promotion credit.</p>\n<p><strong>12. Disputes</strong></p>\n<p>Except where prohibited by law, as a condition of participating in this Sweepstakes/Prize Promotion, each Participant agrees that (1) any and all disputes and causes of action arising out of or connected with this Sweepstakes/Prize Promotion, including but not limited to prize awarded, shall be resolved individually, without resort to any form of class action, and exclusively by final and binding arbitration under the rules of the American Arbitration Association and held at the AAA regional office nearest the Entrant (or for Canadian residents the International Centre for Dispute Resolution); (2) the Federal Arbitration Act shall govern the interpretation, enforcement and all proceedings at such arbitration; and (3) judgment upon such arbitration award may be entered in any court having jurisdiction. Under no circumstances will any Participant be permitted to obtain awards for, and Participant hereby waives all rights to claim, punitive, incidental or consequential damages, or any other damages, including attorneys&#8217; fees, other than Participant&#8217;s actual out-of-pocket expenses (i.e., costs associated with participating in this Sweepstakes/Prize Promotion), and Participant further waives all rights to have damages multiplied or increased. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATIONS OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE MAY NOT APPLY TO YOU. All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of the entrant and Sponsor in connection with the Sweepstakes, shall be governed by, and construed in accordance with, the laws of the State of New York, without giving effect to any choice of law or conflict of law rules (whether of the State of New York or any other jurisdiction), which would cause the application of the laws of any jurisdiction other than the State of New York.</p>\n<p>To ensure fairness and the integrity of the promotion to all Participants, the Sponsor/Promoter will respond to questions via <a href=\"mailto:support@chumbacasino.com\">support@chumbacasino.com</a> and may post updates/communications on its Facebook page.</p>\n<p>Any Participant posting or seen to be posting comments on Sponsor’s/Promoter’s Facebook page or elsewhere during the promotion that are considered bullying, spiteful or upsetting to other contestants and fans of Chumba Casino or directly aimed at the Sponsor/Promoter, will have their comments removed and will be disqualified from the Sweepstakes/Prize Promotion. The Sponsor/Promoter reserves the right to alert Facebook to any such behaviour and Participant may have his/her Facebook account frozen pending investigation.</p>\n<p><strong>13. Participant&#8217;s Personal Information</strong></p>\n<p>Information collected from Participants is subject to the Sponsor&#8217;s/Promoter’s Privacy Policy which is available at <a href=\"http://www.chumbacasino.com\">http://www.chumbacasino.com</a>.</p>\n","yoast_meta":{"yoast_wpseo_title":"Sweeps Rules - Chumba Casino","yoast_wpseo_metadesc":"","yoast_wpseo_canonical":"http://localhost:8000/sweeps-rules/","yoast_wpseo_facebook_title":"","yoast_wpseo_facebook_description":"","yoast_wpseo_facebook_type":"page","yoast_wpseo_facebook_image":"","yoast_wpseo_twitter_title":"","yoast_wpseo_twitter_description":"","yoast_wpseo_twitter_image":"","yoast_wpseo_social_url":"http://localhost:8000/sweeps-rules/","yoast_wpseo_company_or_person":"","yoast_wpseo_person_name":"","yoast_wpseo_company_name":"","yoast_wpseo_company_logo":"","yoast_wpseo_website_name":""},"acf":{"test_comments_field":"","tags":null,"content":null,"title":null,"questions":null,"scholarship_hero_title":null,"scholarship_hero_subtitle":null,"scholarship_title":null,"scholarship_section":null,"scholarship_status":null,"closing_date":null,"scholarship_application_email":null,"scholarship_application_button":null,"scholaraship_prizes":null,"header_text":null,"category":null,"about_title":null,"about_content":null,"faq_title":null,"faq_content":null,"content_bottom":null,"about_image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"bc4fce52-2faf-5203-81b0-d58a3a70b964"}}