{"data":{"wordpressPage":{"title":"Responsible Gaming Facebook","content":"<p><strong>Responsible Gaming</strong></p>\n<p>Chumba Casino is committed to endorsing responsible gaming as a policy of customer care and social responsibility. We believe it is our responsibility to you, our customers, to ensure that you enjoy your wagering experience on our site, while remaining fully aware of the social and financial harms associated with problem gaming.</p>\n<p><strong>Maintaining control</strong></p>\n<p>Gaming should be treated as a fun pastime, and not as a means to generate income. Whilst the majority of the population can treat gaming as recreation and spend only what they can afford to risk, for some it can be more difficult. In order to maintain control of your gaming habits we remind you to always consider the following points:</p>\n<p>1. Gaming should be done in moderation and undertaken as a form of leisure not as a genuine way of making money.<br />\n2. Avoid chasing losses &#8211; there will always be another day.<br />\n3. Only game when you can cover the losses.<br />\n4. Keep track of the time and monitor the amount of money you spend.<br />\n5. Should you need a break from gaming, self-exclusion can be activated through the <u><a href=\"https://chumbacasino.zendesk.com/hc/en-us/requests/new?ticket_form_id=539268\" target=\"_blank\" rel=\"noopener noreferrer\">self-exclusion facility</a></u>.<br />\n6. If you need to talk to someone about any concerns you may have with your gaming, please contact a counselor on the <a href=\"http://rgf.org.mt/\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Responsible Gaming Foundation</u></a>.</p>\n<p><strong>Do you have a problem?</strong></p>\n<p>If you are concerned that gaming has had a negative impact on your life or someone else&#8217;s then the following questions may help you find out.</p>\n<p>1. Does gaming prevent you from attending work or college?<br />\n2. Do you game to pass time or to escape boredom?<br />\n3. Do you game alone for long periods of time?<br />\n4. Have others ever criticised you for your gaming?<br />\n5. Have you lost interest in family, friends or hobbies due to gaming?<br />\n6. Have you ever lied to cover up the amount of money or time you spend gaming?<br />\n7. Have you lied, stolen or borrowed in order to maintain betting habits?<br />\n8. Are you reluctant to spend &#8220;gaming money&#8221; on anything else?<br />\n9. Do you game until you lose all your money?<br />\n10. After losing, do you feel that you have to try and win back the losses as soon as possible?<br />\n11. If you run out of money when gaming, do you feel lost and in despair and feel the need to game again as soon as possible?<br />\n12. Do arguments, frustrations or disappointments make you want to game?<br />\n13. Does gaming make you depressed or even suicidal?</p>\n<p>The more questions that you answer &#8220;yes&#8221; to, the more likely it is that you are having difficulties with your gaming. To speak with someone who can give you advice and support, please contact a counselor on the <a href=\"http://rgf.org.mt/\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Responsible Gaming Foundation</u></a>.</p>\n<p><strong>Self-exclusion</strong></p>\n<p>Should you need to take a break from gaming, you can apply limits which can <a href=\"https://chumbacasino.zendesk.com/hc/en-us/requests/new?ticket_form_id=539268\" target=\"_blank\" rel=\"noopener noreferrer\"><u>be activated in with our self-exclusion facility</u></a>. Self-exclusion allows you to set limits on the your wagers, losses, and amount of time spent playing. You can also choose to close your account. Doing so means that your account will remain closed for a minimum period of 1 week, and will not be reactivated under any circumstances during the exclusion period. This is the major difference to a standard account closure request. A written request (after 1 week has elapsed) is required before account re-opening can be considered.</p>\n<p>For help with gaming problems, please visit the <a href=\"http://rgf.org.mt/\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Responsible Gaming Foundation.</u></a> website.</p>\n<p><strong>Underage gaming</strong></p>\n<p>It is illegal for anyone under the age of 18 to open an account or to game on Chumba Casino. Chumba Casino takes its responsibilities in this regard very seriously. We carry out age verification checks on all customers who use payment mechanisms which are available to under 18s and additionally perform random age verification checks on customers using other forms of funding mechanisms.</p>\n<p>Please note that anyone under the age of 18 found to be using the site will have any winnings forfeited and may also be reported to the police.</p>\n<p><strong>Filtering systems</strong></p>\n<p>Filtering solutions allow parents to regulate access to the internet, based on chosen criteria. Parents can use filters to prevent their children from accessing, amongst other things, gaming websites. If you share your computer with friends or family who are under the legal age to register or bet with our site, or have requested self-exclusion from gaming sites, please consider parental filtering solutions such as:</p>\n<p>Net Nanny™: <a href=\"http://www.netnanny.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.netnanny.com</a>; CyberPatrol: <a href=\"http://www.cyberpatrol.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.cyberpatrol.com</a></p>\n","yoast_meta":{"yoast_wpseo_title":"Responsible Gaming Facebook - Chumba Casino","yoast_wpseo_metadesc":"","yoast_wpseo_canonical":"http://localhost:8000/responsible-gaming-facebook/","yoast_wpseo_facebook_title":"","yoast_wpseo_facebook_description":"","yoast_wpseo_facebook_type":"page","yoast_wpseo_facebook_image":"","yoast_wpseo_twitter_title":"","yoast_wpseo_twitter_description":"","yoast_wpseo_twitter_image":"","yoast_wpseo_social_url":"http://localhost:8000/responsible-gaming-facebook/","yoast_wpseo_company_or_person":"company","yoast_wpseo_person_name":"","yoast_wpseo_company_name":"","yoast_wpseo_company_logo":"","yoast_wpseo_website_name":""},"acf":{"test_comments_field":null,"tags":null,"content":null,"title":null,"questions":null,"scholarship_hero_title":null,"scholarship_hero_subtitle":null,"scholarship_title":null,"scholarship_section":null,"scholarship_status":null,"closing_date":null,"scholarship_application_email":null,"scholarship_application_button":null,"scholaraship_prizes":null,"header_text":null,"category":null,"about_title":null,"about_content":null,"faq_title":null,"faq_content":null,"content_bottom":null,"about_image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"a227cb0e-969c-5006-b48d-d7cd35a2e476"}}