{"data":{"wordpressPage":{"title":"Responsible Social Gaming","content":"<div class=\"legal-window-wrap\">\n<p>Chumba Casino is committed to endorsing responsible social gaming as a policy of customer care and social responsibility.</p>\n<p>We believe it is our responsibility to you, our customers, to ensure that you enjoy your experience on our platforms, while remaining fully aware of the potential risks that can be associated with computer gaming if you don’t remain in control.</p>\n<p>To ensure that you continue to enjoy safe and manageable play, we fully support responsible social gaming and have put measures in place to assist players who wish to control their play.|</p>\n<ol>\n<li><strong>Keeping track of your play</strong><br />\nPlaying computer games should be treated as a fun pastime. Here are some tips to help you maintain control of your gaming:</p>\n<ol type=\"a\">\n<li><strong>Keep it fun</strong><br />\nPlaying computer games is a form of entertainment. Entertainment costs money. But remember computer games should be played in moderation and not to escape reality or to generate income through winning prizes.</li>\n<li><strong>Don’t spend too much</strong><br />\nSet a budget for your entertainment and stick to it. Only purchase Gold Coins if you can afford to.<br />\nYou can always make use of free play via Chumba Casino’s alternative methods of entry (see <a href=\"https://jeffazvgithubber.github.io/sweeps-rules/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">$weeps Rules</a>).</li>\n<li><strong>Keep track of the time</strong><br />\nWe’re thrilled you’re here and we hope that can continue. However, don’t let gaming take up too much of your time. Just like going to the cinema, we’re here when you need some entertainment.</li>\n<li><strong>Make use of our gaming management tools</strong><br />\nShould you require some time out, you can take a break from playing at any time by following the steps in section 2.<br />\nIf you think you may be gaming too often, then it may be handy to consider the self-assessment questions in section 3 below.</li>\n</ol>\n</li>\n<li><strong>Staying in Control</strong><br />\nWe encourage our customers to game responsibly, so we offer a variety of responsible social gaming features.</p>\n<ol>\n<li><strong>Session Reminders</strong><br />\nChumba Casino assists players to game responsibly by operating a Session Reminder for players each hour.<br />\nThe Session Reminder:</p>\n<ol type=\"a\">\n<li>suspends play and indicates how long you have been playing;</li>\n<li>displays a player’s Gold Coin and Sweepstakes winnings since logging in; and</li>\n<li>allows you to end the session or continue playing.</li>\n</ol>\n</li>\n<li><strong>Set Daily Limits</strong><br />\nThis facility provides you with the option to pre-set:</p>\n<ol type=\"a\">\n<li>how many Gold Coins you can purchase each day;</li>\n<li>the amount of Gold Coins and/or $weeps Cash™ you play each day;</li>\n<li>how much time you spend playing each day; and/or</li>\n<li>the amount of Gold Coins and/or $weeps Cash™ you may lose each day.</li>\n</ol>\n<p>To pre-set a limit:</p>\n<ul type=\"circle\">\n<li>select the “Contact Us” link on the platform;</li>\n<li>select “Request to Apply Limits on my Gaming” in the drop-down menu;</li>\n<li>complete the remainder of the form and submit it,</li>\n</ul>\n<p>(<a href=\"https://chumbacasino.zendesk.com/hc/en-us/requests/new?ticket_form_id=41924\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Gaming Limits Feature</a>).</p>\n<p>Each day refers to a 24-hour period.</p>\n<p>We will endeavour to apply your limits as soon as practically possible, however, please note that this process takes a reasonable working period to implement. The limits will not come into effect until they have been fully implemented and this has been communicated to you. If after this you find that the limits have not taken effect, it is your responsibility to inform us immediately.</p>\n<p>You may change or revoke your pre-set limits by:</p>\n<ul type=\"circle\">\n<li>sending us a request by selecting the “Contact Us” link on the platform;</li>\n<li>selecting “Request Support” from the drop-down menu;</li>\n<li>completing the remainder of the form and submitting it,</li>\n</ul>\n<p>(<strong><a href=\"https://chumbacasino.zendesk.com/hc/en-us/requests/new?ticket_form_id=41924\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Request Support Feature</a></strong>).<br />\nA request to increase a limit will come into effect immediately, a request to decrease or revoke a limit only takes effect seven (7) days after we have received the request.</p>\n</li>\n<li><strong>Take a break (self-exclusion options)</strong><br />\nIf you feel that you want to take a break, or that your gaming has become problematic, you may voluntarily exclude yourself from the Chumba Casino platform via the <a href=\"https://chumbacasino.zendesk.com/hc/en-us/requests/new?ticket_form_id=41924\" target=\"_blank\" rel=\"noopener noreferrer\">Gaming Limits Feature</a>. You may request to exclude yourself from the Chumba Casino platform:</p>\n<ol type=\"a\">\n<li>for a definite period (<strong>Definite Self-Exclusion</strong>) by making a written request in the space provided;<br />\nor</li>\n<li>for an indefinite period (<strong>Indefinite Self-Exclusion</strong>) by selecting the “Lock my account” option.</li>\n</ol>\n<p>We will endeavour to apply your self-exclusion as soon as practically possible, however, please note that this process takes a reasonable working period to implement. We will not consider the self-exclusion period as having commenced until it has been implemented by us and communicated to you. If after this you find that you can still access the Chumba Casino platform, it is your responsibility to inform us immediately.</p>\n<p>During a self-exclusion period, you will not have any access to the Chumba Casino platform. If you require access to your account history and information you will need to email Customer Support at <a href=\"mailto:support@chumbacasino.com\">support@chumbacasino.com</a>.</p>\n<p>At the conclusion of a Definite Self-Exclusion, your access to the Chumba Casino platform will be automatically reinstated.</p>\n<p>When an Indefinite Self-Exclusion is applied, it will only be possible to reopen your account by making a written email request to <a href=\"mailto:support@chumbacasino.com\">support@chumbacasino.com</a>. The Indefinite Self-Exclusion will only be lifted 7 days after the email request is received by us.</p>\n<p>Once the self-exclusion is applied, you will no longer receive any further marketing materials from us. We strongly recommend that you also seek exclusion from all other social gaming platforms you have an active account with. If you use social media channels, you should take steps to ensure that you don’t receive our news or updates.</p>\n<p>We may exclude you from Chumba Casino platform for a definite or indefinite period in our sole discretion if your conduct indicates that you may have a computer gaming problem.</p>\n</li>\n<li><strong>Stop playing/Close your account</strong><br />\nYou may choose to close your account. If you wish to do so, make a written email request to <a href=\"mailto:support@chumbacasino.com\">support@chumbacasino.com</a>.</li>\n<li><strong>Activity Statement</strong><br />\nInformation relating to your gaming for the last two weeks can be viewed in the Gaming History section of Chumba Casino (where you can view your Gold Coin and $weeps Cash™ play) and in the Transaction History section of the platform (where you can view your Gold Coin purchases, Sweepstakes prizes and prize redemptions). For information relating to your gaming that goes back more than two weeks, please contact Customer Support (refer to section 5.1 of our Player Protection Policy below).</li>\n</ol>\n</li>\n<li><strong>Self-Assessment</strong><br />\nIf you think your or someone else’s computer gaming is becoming problematic, then it may be handy to consider the self-assessment questions below.</p>\n<ol type=\"a\">\n<li>Do you often re-live gaming experiences or think about future ones?</li>\n<li>Do you hide or lie about your gaming?</li>\n<li>Do you get very angry when someone or something interrupts a game?</li>\n<li>Have you ever taken a break from gaming and binged uncontrollably upon your return?</li>\n<li>When upset, do you soothe yourself with games or plans to game?</li>\n<li>Do you find yourself gaming in the early morning?</li>\n<li>Do you find ways to game when away from home?</li>\n<li>Do you set limits with gaming and then break them, playing hours longer than intended?</li>\n<li>Do you lose hours of sleep to gaming?</li>\n<li>Have you called in sick or late to work or skipped classes to game?</li>\n<li>Have you sworn off a game, uninstalled it, and later returned to it?</li>\n<li>Do you feel guilt and shame around your gaming?</li>\n<li>Does gaming contribute to arguments in your relationships?</li>\n<li>Has gaming taken the place of any hobbies or sports you used to enjoy?</li>\n<li>Do you forget appointments, responsibilities or deadlines in work or school when gaming?</li>\n<li>Do you become irritated and defensive when people suggest you might be gaming too much?</li>\n<li>Have your hours spent gaming increased over time?</li>\n<li>Do you blow off social events to game?</li>\n<li>Have you lost contact with friends and family since gaming?</li>\n<li>Do you have intense feelings (highs, lows, anger, fear) while gaming?</li>\n</ol>\n<p>The more questions that you answer “yes” to, the more likely it is that you are having difficulties with your gaming. To speak with someone who can give you advice and support, please contact the Support Organisation referred to in section 4.</p>\n</li>\n<li><strong>Support Organisation</strong><br />\nIf you or someone you know has a problem with gaming, we advise that you consider assistance from Computer Gaming Addicts Anonymous <a href=\"http://cgaa.info/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">http://cgaa.info/</a>.</li>\n</ol>\n<h2>Player Protection Policy</h2>\n<ol>\n<li><strong>Protection of Minors</strong><br />\nWith the internet accessible via mobile devices and in homes around the world, responsible online gaming relies heavily on parental control and supervision. In order to ensure child safety on the internet, we encourage our customers to make use of filtering software to prevent minors from accessing inappropriate online material.</li>\n<li><strong>Tips for parents</strong><br />\nWe offer the following tips for parents:</p>\n<ol type=\"a\">\n<li>Keep your username and password safe.</li>\n<li>Do not leave your computer or device unattended when logged in to your account.</li>\n<li>Do not use the “Remember Me” feature on a shared computer or device, especially if you share your computer or device with children.</li>\n<li>Take particular care regarding the use by minors of all electronic and mobile devices.</li>\n<li>Keep your bank cards and bank account details out of reach of children.</li>\n<li>Do not allow minors (under 18 years) to participate in any gaming activity meant for adults (18+ years).</li>\n<li>Make use of filtering software to prevent your children from accessing inappropriate material online.</li>\n</ol>\n<p>If you share your device or computer with friends or family who are under the legal age to participate in online social gaming, we recommend that you restrict their access to gaming platforms by using one of the below services:</p>\n<ol type=\"a\">\n<li>Netnanny.com</li>\n<li>Cybersitter.com</li>\n<li>betterinternetforkids.eu</li>\n</ol>\n</li>\n<li><strong>Tips for Players</strong>\n<ol type=\"a\">\n<li>Make sure that the decision to play Chumba Casino is your own personal choice.</li>\n<li>Determine how much you will spend before playing.</li>\n<li>Before you start playing, familiarise yourself with the rules of the games.</li>\n</ol>\n<p>We suggest that you don’t play on our platform if:</p>\n<ol type=\"a\">\n<li>it interferes with your daily responsibilities;</li>\n<li>you are being treated or are in recovery for any type of dependency;</li>\n<li>you are under the influence of alcohol or any other substance; or</li>\n<li>your primary purpose is to pay debts using prizes you might win.</li>\n</ol>\n</li>\n<li><strong>The Gaming Contract and Privacy</strong> To play our games, you are required to enter into a ‘Customer Contract’ with VGW Group during the registration process by submitting personal data and agreeing to the Terms and Conditions. By entering into a ‘Customer Contract’ with VGW Group you are bound by the <a href=\"https://jeffazvgithubber.github.io/terms-and-conditions/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Terms &amp; Conditions</a>, <a href=\"https://jeffazvgithubber.github.io/sweeps-rules/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">$weeps Rules</a>, <a href=\"https://jeffazvgithubber.github.io/privacy-policy/\">Privacy Policy</a>, Responsible Social Gaming Policy, promotion or competition specific terms and conditions, and other rules and policies from time to time.</li>\n<li><strong>Customer Support</strong>\n<ol>\n<li><strong>Customer Support</strong><br />\nIf you would like to contact Customer Support or have a complaint regarding our services, you may contact us by:</p>\n<ol type=\"a\">\n<li>selecting the “Contact Us” link on the platform, selecting “Request Support” as the issue, completing the remainder of the form and clicking “Submit” <a href=\"https://chumbacasino.zendesk.com/hc/en-us/requests/new?ticket_form_id=41924\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>(Request Support Feature)</strong></a>;<br />\nor</li>\n<li>emailing <a href=\"mailto:support@chumbacasino.com\">support@chumbacasino.com</a></li>\n</ol>\n<p>Customer complaints of any nature must be submitted within 3 months of the issue occurring.</p>\n</li>\n<li><strong>Information which must be Included in any written communication</strong><br />\nTo protect your privacy, all email communications between you and us should be carried out using the email address that you have registered with your customer account. Failure to do so may result in our response being delayed.</p>\n<p>The following information must be included in any written communication with us (including a complaint):</p>\n<ol type=\"a\">\n<li>your username;</li>\n<li>your first name and surname, as registered on your customer account;</li>\n<li>a detailed explanation of the enquiry/complaint/claim; and</li>\n<li>any specific dates and times associated with the (d) enquiry/complaint/claim (if applicable).</li>\n</ol>\n<p>Please note that any failure to submit written communication with the information outlined above may result in a delay in our ability to identify and respond to your complaint/claim in a timely manner.<br />\nUpon receipt, we will endeavour to reply to your communication within 48 hours. Further, best efforts will be made to resolve any reported matter promptly and, at a maximum, within 10 days, depending in the complexity of the matter. If for some reason you are not satisfied with the resolution of your complaint/claim please refer to our <a href=\"https://jeffazvgithubber.github.io/terms-and-conditions/\" target=\"_blank\" rel=\"noopener noreferrer\">Terms &amp; Conditions</a>.</p>\n</li>\n</ol>\n</li>\n</ol>\n</div>\n","yoast_meta":{"yoast_wpseo_title":"Responsible Social Gaming - Chumba Casino","yoast_wpseo_metadesc":"","yoast_wpseo_canonical":"https://jeffazvgithubber.github.io/responsible-gaming/","yoast_wpseo_facebook_title":"","yoast_wpseo_facebook_description":"","yoast_wpseo_facebook_type":"page","yoast_wpseo_facebook_image":"","yoast_wpseo_twitter_title":"","yoast_wpseo_twitter_description":"","yoast_wpseo_twitter_image":"","yoast_wpseo_social_url":"https://jeffazvgithubber.github.io/responsible-gaming/","yoast_wpseo_company_or_person":"","yoast_wpseo_person_name":"","yoast_wpseo_company_name":"","yoast_wpseo_company_logo":"","yoast_wpseo_website_name":""},"acf":{"test_comments_field":"test","tags":null,"content":null,"title":null,"questions":null,"scholarship_hero_title":null,"scholarship_hero_subtitle":null,"scholarship_title":null,"scholarship_section":null,"scholarship_status":null,"closing_date":null,"scholarship_application_email":null,"scholarship_application_button":null,"scholaraship_prizes":null,"header_text":null,"category":null,"about_title":null,"about_content":null,"faq_title":null,"faq_content":null,"content_bottom":null,"about_image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"ff433395-3daf-5bf0-a848-c25db1ab67bb"}}