{"data":{"wordpressPage":{"title":"Video Poker","content":"","yoast_meta":{"yoast_wpseo_title":"Learn How To Play Video Poker Online | Video Poker Strategy","yoast_wpseo_metadesc":"This page explains how to play video poker to a high standard. It contains the basic rules, types of bets, the odds and payouts of video poker. It is designed for people that have never played video poker before, and If you are looking for professional video poker strategy.","yoast_wpseo_canonical":"http://localhost:8000/strategy/video-poker/","yoast_wpseo_facebook_title":"","yoast_wpseo_facebook_description":"","yoast_wpseo_facebook_type":"page","yoast_wpseo_facebook_image":"","yoast_wpseo_twitter_title":"","yoast_wpseo_twitter_description":"","yoast_wpseo_twitter_image":"","yoast_wpseo_social_url":"http://localhost:8000/strategy/video-poker/","yoast_wpseo_company_or_person":"","yoast_wpseo_person_name":"","yoast_wpseo_company_name":"","yoast_wpseo_company_logo":"","yoast_wpseo_website_name":""},"acf":{"test_comments_field":null,"tags":null,"content":null,"title":"<h1 style=\"text-align: center;\">VIDEO POKER STRATEGY</h1>\n<p>Video Poker is a simple game that is quick and easy to learn. The rules may vary depending on what version is being played, but they all operate under the same concept. You always get five cards. The normal poker hand ranks are used, and players can discard or hold as many of their cards as they like. All cards discarded will be replaced at random. If your hand matches any of the winning combinations, you receive a payout.</p>\n<p>There is a minimum hand rule that governs how much can be won. The minimum hand rule means a player has to have at least the minimum hand to be eligible and claim a payout. It differs from game to game and depends if the game uses wildcards. Wildcards increase the minimum hand because the player has more chances of creating big winning poker hands.</p>\n<p>The minimum hand can be as high as Three Of A Kind, which means the player has to get at least a Three Of A Kind to claim a payout and as low as a pair of jacks. A pair of jacks or tens is the standard minimum for most games. The minimum will vary, so it’s important to check the game before beginning play, to avoid confusion.</p>\n<p>The wildcard is always a joker or 2, which means that jokers and 2s can be used to substitute for any card to create winning poker hands. So if a player has three jacks, a joker and one six. It can be four of a kind because the joker, substitutes as a jack. It can also be a Full House but it’s a lower ranked hand, so there is no point in substituting it for a six.</p>\n","questions":null,"scholarship_hero_title":null,"scholarship_hero_subtitle":null,"scholarship_title":null,"scholarship_section":null,"scholarship_status":null,"closing_date":null,"scholarship_application_email":null,"scholarship_application_button":null,"scholaraship_prizes":null,"header_text":"<h2><strong>VIDEO POKER </strong></h2>\n<h2>STRATEGY</h2>\n","category":"","about_title":null,"about_content":null,"faq_title":null,"faq_content":null,"content_bottom":null,"about_image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"825c12ae-0b6b-54bc-9cfb-0413a7ebfdcb"}}